## Importación de librerías que utilizaremos

In [16]:
#%pip install mysql-connector-python
import mysql.connector as conn
import pandas as pd
from sqlalchemy import create_engine

## Hacemos la conexión al servidor para crear una nueva base de datos vacía que se llamará 'movies'

In [12]:
conexion = conn.connect(host='localhost',  
                       user='root',        
                       passwd='password', 
                       )

cursor = conexion.cursor()
cursor.execute('create database movies;')

## Mediante el siguiente código, creamos la string de conexión a nuestra nueva base de datos 'movies'

In [17]:
str_conn = 'mysql+pymysql://root:password@localhost:3306/movies'

cursor = create_engine(str_conn)

## Procedemos a crear las tablas en nuestra base de datos, lo primero que hacemos es cargar nuestros csv en un dataframe

In [79]:
data = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/csv_limpios/actor.csv', encoding='latin1')

## Luego utilizamos el comando .to_sql para crear una tabla en nuestra base de datos que contendrá todas las columnas y filas cargadas en el dataframe, asignamos el nombre de la tabla, en este caso la tabla es la de 'actor'

In [80]:
data.to_sql(name='actor',      # nombre de la tabla
            con=cursor,          # conexion al servidor
            if_exists='replace',  # reemplaza la tabla si existe
            index=False
           )

199

## Hacemos el mismo procedimiento para el resto de las tablas que serán las de 'inventory', 'language', 'old_hdd', 'rental' y 'film'

In [67]:
data2 = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/csv_limpios/inventory_clean.csv', encoding='latin1')

data2.to_sql(name='inventory',      
            con=cursor,          
            if_exists='replace', 
            index=False
           )

1000

In [69]:
data3 = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/csv_limpios/language_clean.csv', encoding='latin1')

data3.to_sql(name='language',      
            con=cursor,          
            if_exists='replace', 
            index=False
           )

6

In [71]:
data4 = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/csv_limpios/old_hdd_clean.csv', encoding='latin1')

data4.to_sql(name='old_hdd',      
            con=cursor,          
            if_exists='replace', 
            index=False
           )

1000

In [75]:
data5 = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/csv_limpios/rental_clean.csv', encoding='latin1')

data5.to_sql(name='rental',      
            con=cursor,          
            if_exists='replace', 
            index=False
           )

1000

In [76]:
data6 = pd.read_csv('/Users/christelllameda/ironhack/Proyecto-Nro-2/data/csv_limpios/film_clean.csv', encoding='latin1')

data6.to_sql(name='film',      
            con=cursor,          
            if_exists='replace', 
            index=False
           )

1000

## Chequeamos las tablas creadas en nuestra base de datos

In [81]:
cursor.execute('show tables;').fetchall()

[('actor',),
 ('film',),
 ('inventory',),
 ('language',),
 ('old_hdd',),
 ('rental',)]

##

In [22]:
query = '''

SELECT day_of_week, COUNT(*) AS total_rentals   
FROM rental
GROUP BY day_of_week
ORDER BY total_rentals DESC

;
'''


datos = pd.read_sql(query, cursor)

datos.head()

  day_of_week  total_rentals
0    Saturday            196
1    Thursday            174
2      Friday            166
3      Monday            158
4      Sunday            154

##

In [23]:
query = '''
SELECT f.title AS pelicula_mas_rentada, COUNT(rental_id) AS veces_rentada
FROM film f
INNER JOIN inventory i ON f.film_id = i.film_id
INNER JOIN rental r ON i.inventory_id = r.inventory_id
GROUP BY f.title
ORDER BY veces_rentada DESC
;
'''


datos = pd.read_sql(query, cursor)

datos.head()

   pelicula_mas_rentada  veces_rentada
0         BOOGIE AMELIE              4
1           ANTHEM LUKE              3
2  BARBARELLA STREETCAR              3
3        BINGO TALENTED              3
4    BUCKET BROTHERHOOD              3